results/pro6000_h100_h200_b200_01_2026/h100/concurrency_64/h100_x_8_QuantTrio_Qwen3-Coder-480B-A35B-Instruct-AWQ_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  1905.80   
Total input tokens:                      2048000   
Total generated tokens:                  2048000   
Request throughput (req/s):              0.13      
Output token throughput (tok/s):         1074.62   
Peak output token throughput (tok/s):    1740.00   
Peak concurrent requests:                67.00     
Total token throughput (tok/s):          2149.23   
---------------Time to First Token----------------
Mean TTFT (ms):                          188579.00 
Median TTFT (ms):                        204804.32 
P99 TTFT (ms):                           413287.69 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.81     
Median TPOT (ms):                        25.13     
P99 TPOT (ms):                           47.41     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.80     
Median ITL (ms):                         22.52     
P99 ITL (ms):                            26.65     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          427007.14 
Median E2EL (ms):                        415717.18 
P99 E2EL (ms):                           748213.87 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0', '1', '2', '3']
              capabilities: [gpu]
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=<REDACTED>
      - HF_HOME=/mnt/localssd/hf_models
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 4
      --pipeline-parallel-size 1
      --model /mnt/localssd/hf_models/QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --served-model-name QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --max-num-seqs 128 --max-model-len 16384 --enable-expert-parallel
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  vllm_1:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_1
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['4', '5', '6', '7']
              capabilities: [gpu]
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=<REDACTED>
      - HF_HOME=/mnt/localssd/hf_models
    ports:
      - "8001:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 4
      --pipeline-parallel-size 1
      --model /mnt/localssd/hf_models/QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --served-model-name QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --max-num-seqs 128 --max-model-len 16384 --enable-expert-parallel
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  nginx:
    image: nginx:alpine
    container_name: nginx_lb
    ports:
      - "8080:8080"
    volumes:
      - /home/natalia/server-benchmark/nginx.vllm.conf:/etc/nginx/nginx.conf:ro
    depends_on:
      - vllm_0
      - vllm_1

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=<REDACTED>
      - HF_HOME=/mnt/localssd/hf_models
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ     --dataset-name random     --random-input-len 8000     --random-output-len 8000     --max-concurrency 64     --num-prompts 256     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://nginx_lb:8080
==================================================